src/cfe/DataProcessors/кбп_КонструкторСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>кбп_КонструкторСхем</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыПолучателейОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыПолучателейОповещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРеквизита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ТипыШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ТипыШагов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вариант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таймер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декорация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СтатусыВерсийСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СтатусыВерсийСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опубликована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_РежимыСлияния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_РежимыСлияния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Любая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NизM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ДействияПриПросрочке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_ДействияПриПросрочке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ничего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эскалация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автовыполнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СобытияПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_СобытияПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗадачаНазначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокИстекает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаПросрочена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упоминание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессЗапущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессПрерван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеНачалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеЗакончилось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобытиеШага</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дайджест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводкаЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПросрочках</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/ChartsOfCharacteristicTypes/кбп_ПеременныеПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>кбп_ПеременныеПроцессов</Name>
			<Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
				<v8:NumberQualifiers>
					<v8:Digits>17</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВЗадаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cfe/DataProcessors/кбп_КонструкторСхем/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не кбп_Лицензирование.ДоступноДействие("ОткрытиеКонструктора") Тогда
		ВызватьИсключение НСтр("ru = 'Конструктор схем недоступен по условиям лицензии.'");
	КонецЕсли;

	СвязиВерсии = Новый Массив;
	СвязиВерсии.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Схема"));
	Элементы.Версия.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиВерсии);

	Для Каждого ЭлементСписка Из кбп_АдаптерКонфигурации.ТипыОбъектовДляПроцессов() Цикл
		Элементы.ТипПредмета.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	НастроитьПоляВыбора();

	Попытка
		кбп_Действия.ОбновитьОбработчики();
		кбп_АдаптерКонфигурации.ВключитьРегламентныеЗадания();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Конструктор процессов.Обработчики'"), УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Если Параметры.Свойство("Схема") И ЗначениеЗаполнено(Параметры.Схема) Тогда
		Схема = Параметры.Схема;
		Версия = кбп_КомпиляторСхем.ВерсияДляРедактирования(Схема);
	КонецЕсли;
	ПрочитатьВерсию();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не ЭтоЧерновик Или Не Модифицированность И Не СвойстваИзменены Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	Если ЗавершениеРаботы Тогда
		ТекстПредупреждения = НСтр("ru = 'Схема процесса не сохранена.'");
		Возврат;
	КонецЕсли;
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
		НСтр("ru = 'Схема или свойства изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	ОткрытьСхемуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	ПрочитатьВерсию();
КонецПроцедуры

&НаКлиенте
Процедура ТипПредметаПриИзменении(Элемент)
	ЗаписатьТипПредмета();
КонецПроцедуры

&НаКлиенте
Процедура ГрафСхемаВыбор(Элемент)

#Если ВебКлиент Тогда
	// В веб-клиенте текущий элемент графической схемы недоступен — элемент выбирается в списке шагов.
	ПоказатьПредупреждение(, НСтр("ru = 'В веб-клиенте выберите шаг или линию в списке справа.'"));
#Иначе
	ТекущийЭлементСхемы = Элементы.ГрафСхема.ТекущийЭлемент;
	Если ТекущийЭлементСхемы <> Неопределено Тогда
		ПоказатьСвойства(ТекущийЭлементСхемы.Имя);
	КонецЕсли;
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СвойствоПриИзменении(Элемент)
	СвойстваИзменены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвойствоТаблицыПриИзменении(Элемент)
	СвойстваИзменены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВидШагаПриИзменении(Элемент)
	СвойстваИзменены = Истина;
	НастроитьПанель();
КонецПроцедуры

&НаКлиенте
Процедура ВидУсловияПриИзменении(Элемент)
	СвойстваИзменены = Истина;
	НастроитьПанель();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещенияШага

&НаКлиенте
Процедура ОповещенияШагаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Не НоваяСтрока Или Копирование Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	СписокСобытий = Элементы.ОповещенияШагаСобытие.СписокВыбора;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Событие) И СписокСобытий.Количество() > 0 Тогда
		ТекущиеДанные.Событие = СписокСобытий[0].Значение;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ВидПолучателя) Тогда
		ТекущиеДанные.ВидПолучателя = ПредопределенноеЗначение("Перечисление.кбп_ВидыПолучателейОповещений.Исполнитель");
	КонецЕсли;

КонецПроцедуры

// Значение «Кто именно» получает тип по виду получателя: сразу открывается нужный выбор.
&НаКлиенте
Процедура ОповещенияШагаВидПолучателяПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОповещенияШага.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.Получатель = ПустоеЗначениеПолучателя(ТекущиеДанные.ВидПолучателя);
	СвойстваИзменены = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШаги

&НаКлиенте
Процедура ШагиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьСвойстваТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ШагиПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПоказатьСвойстваТекущейСтроки", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)

	Если ЭтоЧерновик Тогда
		СохранитьНаСервере();
	КонецЕсли;
	ПроверитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Опубликовать(Команда)

	Если Не ЭтоЧерновик Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Публикуется только черновик.'"));
		Возврат;
	КонецЕсли;
	СохранитьНаСервере();
	Если ОпубликоватьНаСервере() Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Версия опубликована'"), , Строка(Версия));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСхему(Команда)

	Если ЭтоЧерновик Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Открыт черновик — его можно изменять.'"));
		Возврат;
	КонецЕсли;
	СоздатьЧерновикНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроцесс(Команда)

	Если Не ЕстьОпубликованнаяВерсия(Схема) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'У схемы нет опубликованной версии. Опубликуйте черновик.'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Обработка.кбп_МоиЗадачи.Форма.ЗапускПроцесса", Новый Структура("Схема", Схема), ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Редактирование(Команда)

	Если Не ЭтоЧерновик Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Опубликованная версия не изменяется. Нажмите «Изменить схему».'"));
		Возврат;
	КонецЕсли;
	Элементы.ГрафСхема.Редактирование = Не Элементы.ГрафСхема.Редактирование;
	Элементы.ФормаРедактирование.Пометка = Элементы.ГрафСхема.Редактирование;

КонецПроцедуры

&НаКлиенте
Процедура СвойстваЭлемента(Команда)

#Если ВебКлиент Тогда
	ПоказатьПредупреждение(, НСтр("ru = 'В веб-клиенте выберите шаг или линию в списке справа.'"));
#Иначе
	ТекущийЭлементСхемы = Элементы.ГрафСхема.ТекущийЭлемент;
	Если ТекущийЭлементСхемы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выделите элемент на схеме.'"));
		Возврат;
	КонецЕсли;
	ПоказатьСвойства(ТекущийЭлементСхемы.Имя);
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСвойства(Команда)

	Если Не ЭтоЧерновик Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Опубликованная версия не изменяется. Нажмите «Изменить схему».'"));
		Возврат;
	КонецЕсли;
	ЗаписатьСвойстваНаСервере();
	Если Модифицированность Тогда
		// Название или подпись изменены на панели — сохраняем схему, чтобы изменения были на картинке и в списке.
		СохранитьНаСервере();
	КонецЕсли;
	ПоказатьОповещениеПользователя(НСтр("ru = 'Свойства записаны'"));

КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)

	Если Модифицированность Или СвойстваИзменены Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПеречитатьЗавершение", ЭтотОбъект),
			НСтр("ru = 'Несохранённые изменения будут потеряны. Перечитать?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ПрочитатьВерсию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Переменные(Команда)

	Если Не ЗначениеЗаполнено(Схема) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите схему.'"));
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура("Схема", Схема);
	ОткрытьФорму("ПланВидовХарактеристик.кбп_ПеременныеПроцессов.ФормаСписка", Новый Структура("Отбор", Отбор), ЭтотОбъект,
		Схема);

КонецПроцедуры

&НаКлиенте
Процедура НастроитьУсловие(Команда)

	Если ТекущийВид <> "Линия" Тогда
		Возврат;
	КонецЕсли;
	Если Не ЭтоЧерновик Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Опубликованная версия не изменяется. Нажмите «Изменить схему».'"));
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Схема", Схема);
	ПараметрыФормы.Вставить("АдресНастроек", АдресУсловияЛинии());
	ПараметрыФормы.Вставить("ИдентификаторВладельца", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ЗаголовокЛинии", Лин_Наименование);
	ОткрытьФорму("Обработка.кбп_КонструкторСхем.Форма.УсловиеПерехода", ПараметрыФормы, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("НастроитьУсловиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УсловиеВидимости(Команда)
	ОткрытьУсловиеКнопки("УсловиеВидимости");
КонецПроцедуры

&НаКлиенте
Процедура УсловиеДоступности(Команда)
	ОткрытьУсловиеКнопки("УсловиеДоступности");
КонецПроцедуры

// Редактор условия видимости или доступности кнопки, выбранной в таблице кнопок шага.
&НаКлиенте
Процедура ОткрытьУсловиеКнопки(ИмяУсловия)

	Если ТекущийВид <> "Шаг" Тогда
		Возврат;
	КонецЕсли;
	Если Не ЭтоЧерновик Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Опубликованная версия не изменяется. Нажмите «Изменить схему».'"));
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.КнопкиШага.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Заголовок) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите кнопку в таблице (у кнопки должен быть заголовок).'"));
		Возврат;
	КонецЕсли;
	Кнопка = ПодготовитьУсловиеВидимости(ТекущиеДанные.ИдКнопки, ТекущиеДанные.Заголовок, ИмяУсловия);
	Если Кнопка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Схема", Схема);
	ПараметрыФормы.Вставить("АдресНастроек", Кнопка.Адрес);
	ПараметрыФормы.Вставить("ИдентификаторВладельца", УникальныйИдентификатор);
	Если ИмяУсловия = "УсловиеДоступности" Тогда
		ЗаголовокФормы = СтрШаблон(НСтр("ru = 'Кнопка «%1» доступна, если'"), Кнопка.Заголовок);
	Иначе
		ЗаголовокФормы = СтрШаблон(НСтр("ru = 'Кнопка «%1» видна, если'"), Кнопка.Заголовок);
	КонецЕсли;
	ПараметрыФормы.Вставить("ЗаголовокФормы", ЗаголовокФормы);
	ОткрытьФорму("Обработка.кбп_КонструкторСхем.Форма.УсловиеПерехода", ПараметрыФормы, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("УсловиеВидимостиЗавершение", ЭтотОбъект,
			Новый Структура("ИдКнопки, ИмяУсловия", Кнопка.ИдКнопки, ИмяУсловия)),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПравилаЗапуска(Команда)

	Если Не ЗначениеЗаполнено(Схема) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала выберите или создайте схему.'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Обработка.кбп_КонструкторСхем.Форма.ПравилаЗапуска", Новый Структура("Схема", Схема), ЭтотОбъект, Схема);

КонецПроцедуры

&НаКлиенте
Процедура СтруктураСхемы(Команда)

	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(СтруктураСхемыНаСервере());
	Текст.Показать(НСтр("ru = 'Структура графической схемы'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПустоеЗначениеПолучателя(ВидПолучателя)

	Если ВидПолучателя = ПредопределенноеЗначение("Перечисление.кбп_ВидыПолучателейОповещений.Роль") Тогда
		Возврат ПредопределенноеЗначение("Справочник.кбп_РолиИсполнителей.ПустаяСсылка");
	ИначеЕсли ВидПолучателя = ПредопределенноеЗначение("Перечисление.кбп_ВидыПолучателейОповещений.Пользователь") Тогда
		Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	ИначеЕсли ВидПолучателя = ПредопределенноеЗначение("Перечисление.кбп_ВидыПолучателейОповещений.Обработчик") Тогда
		Возврат ПредопределенноеЗначение("Справочник.кбп_ОбработчикиПроцессов.ПустаяСсылка");
	ИначеЕсли ВидПолучателя = ПредопределенноеЗначение("Перечисление.кбп_ВидыПолучателейОповещений.ИзРеквизита")
		Или ВидПолучателя = ПредопределенноеЗначение("Перечисление.кбп_ВидыПолучателейОповещений.Адрес") Тогда
		Возврат "";
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
	КонецЕсли;
	Модифицированность = Ложь;
	СвойстваИзменены = Ложь;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьУсловиеЗавершение(АдресНастроек, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(АдресНастроек) <> Тип("Строка") Или Не ЗначениеЗаполнено(АдресНастроек) Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьУсловиеНаСервере(АдресНастроек);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Условие записано'"));

КонецПроцедуры

&НаКлиенте
Процедура УсловиеВидимостиЗавершение(АдресНастроек, Кнопка) Экспорт

	Если ТипЗнч(АдресНастроек) <> Тип("Строка") Или Не ЗначениеЗаполнено(АдресНастроек) Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьУсловиеВидимостиНаСервере(Кнопка.ИдКнопки, АдресНастроек, Кнопка.ИмяУсловия);
	Если Кнопка.ИмяУсловия = "УсловиеДоступности" Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Условие доступности записано'"));
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Условие видимости записано'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПрочитатьВерсию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойстваТекущейСтроки() Экспорт

	ТекущиеДанные = Элементы.Шаги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ИдЭлемента = ТекущийИд Тогда
		Возврат;
	КонецЕсли;
	ЗагрузитьСвойстваНаСервере(ТекущиеДанные.ИдЭлемента);

КонецПроцедуры

// Показывает свойства элемента схемы на панели. Несохранённая схема сначала сохраняется:
// у нового элемента ещё нет записи в справочнике.
&НаКлиенте
Процедура ПоказатьСвойства(ИмяЭлемента)

	Имя = ИмяЭлемента;
	Если ЭтоЧерновик И (Модифицированность Или Не ЕстьЭлемент(Версия, Имя)) Тогда
		Переименования = СохранитьНаСервере();
		Если Переименования[Имя] <> Неопределено Тогда
			Имя = Переименования[Имя];
		КонецЕсли;
	КонецЕсли;
	Если Не ЕстьЭлемент(Версия, Имя) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'У этого элемента схемы нет настроек (декорация).'"));
		Возврат;
	КонецЕсли;
	ЗагрузитьСвойстваНаСервере(Имя);

	Для Каждого СтрокаШага Из Шаги Цикл
		Если СтрокаШага.ИдЭлемента = Имя Тогда
			Элементы.Шаги.ТекущаяСтрока = СтрокаШага.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьЭлемент(Версия, Имя)
	Возврат кбп_КомпиляторСхем.ОбъектПоИдЭлемента(Версия, Имя) <> Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьОпубликованнаяВерсия(Схема)
	Возврат ЗначениеЗаполнено(Схема) И ЗначениеЗаполнено(Схема.ТекущаяВерсия);
КонецФункции

// Сохраняет черновик и свойства. Возвращает соответствие «старое имя → новое имя» элементов схемы.
&НаСервере
Функция СохранитьНаСервере()

	Переименования = Новый Соответствие;
	Если Не ЭтоЧерновик Тогда
		Возврат Переименования;
	КонецЕсли;

	Если СвойстваИзменены Тогда
		ЗаписатьСвойстваНаСервере(Ложь);
	КонецЕсли;

	// Реквизит формы типа ГрафическаяСхема на сервере — сам объект схемы: имена элементов проставляются в нём.
	Результат = кбп_КомпиляторСхем.СохранитьЧерновик(Версия, ГрафСхема);
	Переименования = Результат.Переименования;

	Модифицированность = Ложь;
	ЗаполнитьШаги();
	ПоказатьОшибки(Результат.Ошибки, НСтр("ru = 'Схема сохранена.'"));

	// Элемент справочника мог измениться при синхронизации (наименование) — перечитываем панель.
	Ид = ТекущийИд;
	Если Переименования[Ид] <> Неопределено Тогда
		Ид = Переименования[Ид];
	КонецЕсли;
	ТекущийИд = "";
	ЗагрузитьСвойстваНаСервере(Ид);
	Возврат Переименования;

КонецФункции

// Переменные выбираются только из переменных этой схемы, переменные вложенного — из его схемы.
&НаСервере
Процедура НастроитьПоляВыбора()

	ПоСхеме = Новый Массив;
	ПоСхеме.Добавить(Новый СвязьПараметраВыбора("Отбор.Схема", "Схема"));
	СвязиПоСхеме = Новый ФиксированныйМассив(ПоСхеме);
	Элементы.ЭлементШагаТаймерИзПеременной.СвязиПараметровВыбора = СвязиПоСхеме;
	Элементы.ПоляЗаполненияПеременная.СвязиПараметровВыбора = СвязиПоСхеме;
	Элементы.ПараметрыВложенногоПеременнаяРодителя.СвязиПараметровВыбора = СвязиПоСхеме;

	ПоВложенной = Новый Массив;
	ПоВложенной.Добавить(Новый СвязьПараметраВыбора("Отбор.Схема", "ЭлементШага.ВложеннаяСхема"));
	Элементы.ПараметрыВложенногоПеременнаяДочернего.СвязиПараметровВыбора = Новый ФиксированныйМассив(ПоВложенной);
	Элементы.ЭлементШагаПеременнаяЭлемента.СвязиПараметровВыбора = Новый ФиксированныйМассив(ПоВложенной);

	Типы = Перечисления.кбп_ТипыШагов;
	Элементы.ЭлементШагаВидАвтошага.СписокВыбора.Добавить(Типы.Обработка);
	Элементы.ЭлементШагаВидАвтошага.СписокВыбора.Добавить(Типы.Таймер);
	Элементы.ЭлементШагаВидАвтошага.СписокВыбора.Добавить(Типы.Оповещение);

	// Каналы: по одному и все вместе; пусто — как настроил получатель.
	СписокКаналов = Элементы.ОповещенияШагаКаналы.СписокВыбора;
	Каналы = кбп_Оповещения.ДоступныеКаналы();
	Для Каждого Канал Из Каналы Цикл
		СписокКаналов.Добавить(Канал.Значение, Канал.Представление);
	КонецЦикла;
	Если Каналы.Количество() > 1 Тогда
		СписокКаналов.Добавить(СтрСоединить(Каналы.ВыгрузитьЗначения(), ", "), НСтр("ru = 'Все каналы'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция АдресУсловияЛинии()

	Если СвойстваИзменены Тогда
		ЗаписатьСвойстваНаСервере(Ложь);
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(кбп_КомпиляторСхем.УсловиеПерехода(Версия, ТекущийИд), УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗаписатьУсловиеНаСервере(АдресНастроек)

	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	кбп_КомпиляторСхем.ЗаписатьУсловиеПерехода(Версия, ТекущийИд, Настройки);
	Ид = ТекущийИд;
	ТекущийИд = "";
	ЗагрузитьСвойстваНаСервере(Ид);

КонецПроцедуры

// Записывает несохранённые свойства (новой кнопке присваивается ИдКнопки) и возвращает условие видимости кнопки.
&НаСервере
Функция ПодготовитьУсловиеВидимости(Знач ИдКнопки, Знач Заголовок, ИмяУсловия)

	Если СвойстваИзменены Или Не ЗначениеЗаполнено(ИдКнопки) Тогда
		ЗаписатьСвойстваНаСервере();
		ИдКнопки = "";
		Для Каждого СтрокаКнопки Из КнопкиШага Цикл
			Если СтрокаКнопки.Заголовок = Заголовок Тогда
				ИдКнопки = СтрокаКнопки.ИдКнопки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(ИдКнопки) Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Шаг = ЭлементШага.Ссылка;
	Адрес = ПоместитьВоВременноеХранилище(кбп_КомпиляторСхем.УсловиеВидимостиКнопки(Шаг, ИдКнопки, ИмяУсловия),
		УникальныйИдентификатор);
	Возврат Новый Структура("ИдКнопки, Заголовок, Адрес", ИдКнопки, Заголовок, Адрес);

КонецФункции

&НаСервере
Процедура ЗаписатьУсловиеВидимостиНаСервере(ИдКнопки, АдресНастроек, ИмяУсловия)

	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		Настройки = Неопределено;
	КонецЕсли;
	кбп_КомпиляторСхем.ЗаписатьУсловиеВидимостиКнопки(ЭлементШага.Ссылка, ИдКнопки, Настройки, ИмяУсловия);
	Ид = ТекущийИд;
	ТекущийИд = "";
	ЗагрузитьСвойстваНаСервере(Ид);

КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	ПоказатьОшибки(кбп_КомпиляторСхем.ПроверитьВерсию(Версия), НСтр("ru = 'Ошибок не найдено.'"));
КонецПроцедуры

&НаСервере
Функция ОпубликоватьНаСервере()

	Ошибки = кбп_КомпиляторСхем.Опубликовать(Версия);
	Если Ошибки.Количество() > 0 Тогда
		ПоказатьОшибки(Ошибки, "");
		Возврат Ложь;
	КонецЕсли;
	ПрочитатьВерсию();
	ТекстПроверки = НСтр("ru = 'Версия опубликована. Новые процессы будут запускаться по ней — кнопка «Запустить процесс».'");
	Возврат Истина;

КонецФункции

&НаСервере
Процедура СоздатьЧерновикНаСервере()
	Версия = кбп_КомпиляторСхем.СоздатьЧерновик(Схема);
	ПрочитатьВерсию();
КонецПроцедуры

&НаСервере
Процедура ОткрытьСхемуНаСервере()
	Версия = кбп_КомпиляторСхем.ВерсияДляРедактирования(Схема);
	ПрочитатьВерсию();
КонецПроцедуры

&НаСервере
Функция СтруктураСхемыНаСервере()
	Возврат кбп_КомпиляторСхем.СтруктураСхемы(ГрафСхема);
КонецФункции

&НаСервере
Процедура ЗаписатьТипПредмета()

	Если Не ЗначениеЗаполнено(Схема) Тогда
		Возврат;
	КонецЕсли;
	СхемаОбъект = Схема.ПолучитьОбъект();
	СхемаОбъект.ТипПредмета = ТипПредмета;
	СхемаОбъект.Записать();
	ЗаполнитьРеквизитыПредмета();

КонецПроцедуры

// Список выбора «реквизит предмета» для полей к заполнению — реквизиты типа предмета схемы.
&НаСервере
Процедура ЗаполнитьРеквизитыПредмета()

	Список = Элементы.ПоляЗаполненияРеквизитПредмета.СписокВыбора;
	Список.Очистить();
	ОбъектМетаданных = ?(ЗначениеЗаполнено(ТипПредмета), Метаданные.НайтиПоПолномуИмени(ТипПредмета), Неопределено);
	Элементы.ПоляЗаполненияРеквизитПредмета.Видимость = (ОбъектМетаданных <> Неопределено);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Служебные = СтрРазделить("Ссылка,ПометкаУдаления,Проведен,Предопределенный,ИмяПредопределенныхДанных,ЭтоГруппа,Родитель", ",");
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Если Служебные.Найти(Реквизит.Имя) = Неопределено Тогда
			Список.Добавить(Реквизит.Имя, ?(ЗначениеЗаполнено(Реквизит.Синоним), Реквизит.Синоним, Реквизит.Имя));
		КонецЕсли;
	КонецЦикла;
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		Список.Добавить(Реквизит.Имя, Реквизит.Представление());
	КонецЦикла;
	Список.СортироватьПоПредставлению();

КонецПроцедуры

&НаСервере
Процедура ПрочитатьВерсию()

	ГрафСхема = кбп_КомпиляторСхем.ГрафическаяСхемаВерсии(Версия);
	ЭтоЧерновик = ЗначениеЗаполнено(Версия)
		И Версия.Статус = Перечисления.кбп_СтатусыВерсийСхем.Черновик;
	Если ЗначениеЗаполнено(Версия) Тогда
		Статус = СтрШаблон("%1: %2", Версия.Статус, Версия);
	Иначе
		Статус = НСтр("ru = 'Выберите или создайте схему'");
	КонецЕсли;
	ТипПредмета = ?(ЗначениеЗаполнено(Схема), Схема.ТипПредмета, "");
	Элементы.ТипПредмета.Доступность = ЗначениеЗаполнено(Схема);
	ЗаполнитьРеквизитыПредмета();

	Элементы.ГрафСхема.Редактирование = ЭтоЧерновик;
	Элементы.ФормаРедактирование.Пометка = ЭтоЧерновик;
	Элементы.ФормаРедактирование.Доступность = ЭтоЧерновик;
	Элементы.ФормаСохранить.Доступность = ЭтоЧерновик;
	Элементы.ФормаОпубликовать.Доступность = ЭтоЧерновик;
	Элементы.ФормаИзменитьСхему.Доступность = ЗначениеЗаполнено(Версия) И Не ЭтоЧерновик;
	Элементы.ФормаЗапуститьПроцесс.Доступность = ЗначениеЗаполнено(Схема) И ЗначениеЗаполнено(Схема.ТекущаяВерсия);
	Элементы.СтраницыСвойств.ТолькоПросмотр = Не ЭтоЧерновик;
	Элементы.ФормаЗаписатьСвойства.Доступность = ЭтоЧерновик;

	ЗаполнитьШаги();
	ТекстПроверки = "";
	Модифицированность = Ложь;
	ТекущийИд = "";
	СвойстваИзменены = Ложь;
	ЗагрузитьСвойстваНаСервере("");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаги()

	Шаги.Очистить();
	Если Не ЗначениеЗаполнено(Версия) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаЭлемента Из кбп_КомпиляторСхем.ЭлементыДляСписка(Версия) Цикл
		ЗаполнитьЗначенияСвойств(Шаги.Добавить(), СтрокаЭлемента);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПоказатьОшибки(Ошибки, ТекстЕслиНет)

	Для Каждого СтрокаШага Из Шаги Цикл
		СтрокаШага.Ошибка = Ложь;
		СтрокаШага.Метка = "";
	КонецЦикла;
	Если Ошибки.Количество() = 0 Тогда
		ТекстПроверки = ТекстЕслиНет;
		Возврат;
	КонецЕсли;

	Тексты = Новый Массив;
	Для Каждого Ошибка Из Ошибки Цикл
		Тексты.Добавить("• " + Ошибка.Текст);
		Для Каждого СтрокаШага Из Шаги.НайтиСтроки(Новый Структура("ИдЭлемента", Ошибка.Ид)) Цикл
			СтрокаШага.Ошибка = Истина;
			СтрокаШага.Метка = "⚠";
		КонецЦикла;
	КонецЦикла;
	ТекстПроверки = СтрШаблон(НСтр("ru = 'Найдено ошибок: %1'"), Ошибки.Количество())
		+ Символы.ПС + СтрСоединить(Тексты, Символы.ПС);

КонецПроцедуры

#Область ПанельСвойств

// Загружает свойства шага или линии на панель. Изменённые свойства предыдущего элемента сначала записываются.
&НаСервере
Процедура ЗагрузитьСвойстваНаСервере(Ид)

	Если СвойстваИзменены И ЭтоЧерновик Тогда
		ЗаписатьСвойстваНаСервере(Ложь);
	КонецЕсли;
	СвойстваИзменены = Ложь;
	ТекущийИд = "";
	ТекущийВид = "";
	ЗаголовокСвойств = НСтр("ru = 'Свойства'");

	Найденный = Неопределено;
	Если ЗначениеЗаполнено(Версия) И ЗначениеЗаполнено(Ид) Тогда
		Найденный = кбп_КомпиляторСхем.ОбъектПоИдЭлемента(Версия, Ид);
	КонецЕсли;

	Если ТипЗнч(Найденный) = Тип("СправочникСсылка.кбп_ЭлементыСхем") Тогда
		ЗагрузитьШаг(Найденный);
		ТекущийИд = Ид;
		ТекущийВид = "Шаг";
	ИначеЕсли Найденный <> Неопределено Тогда
		Если ЗагрузитьЛинию(Ид) Тогда
			ТекущийИд = Ид;
			ТекущийВид = "Линия";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Версия) И Не ЗначениеЗаполнено(Ид) Тогда
		// Ничего не выбрано: на вкладке «Оповещения» — оповещения процесса целиком.
		ТекущийВид = "Процесс";
		ЗаголовокСвойств = НСтр("ru = 'Свойства: процесс целиком'");
	КонецЕсли;
	ЗагрузитьОповещения();
	НастроитьПанель();

КонецПроцедуры

// Оповещения шага-задачи, шага «Оповещение» или процесса целиком (ФТ-601, ФТ-604).
&НаСервере
Процедура ЗагрузитьОповещения()

	ОповещенияШага.Очистить();
	Типы = Перечисления.кбп_ТипыШагов;
	ЭтоПроцесс = (ТекущийВид = "Процесс");
	Если ТекущийВид = "Шаг" И (ЭлементШага.ТипШага = Типы.Задача Или ЭлементШага.ТипШага = Типы.Оповещение) Тогда
		Шаг = ЭлементШага.Ссылка;
	ИначеЕсли ЭтоПроцесс Тогда
		Шаг = Неопределено;
	Иначе
		Возврат;
	КонецЕсли;
	Для Каждого Оповещение Из кбп_КомпиляторСхем.ОповещенияШага(Версия, Шаг) Цикл
		ЗаполнитьЗначенияСвойств(ОповещенияШага.Добавить(), Оповещение);
	КонецЦикла;
	СписокСобытий = Элементы.ОповещенияШагаСобытие.СписокВыбора;
	СписокСобытий.Очистить();
	Для Каждого Событие Из кбп_Оповещения.СобытияДляНастройки(ЭтоПроцесс) Цикл
		СписокСобытий.Добавить(Событие);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьШаг(Шаг)

	ЗначениеВРеквизитФормы(Шаг.ПолучитьОбъект(), "ЭлементШага");
	Настройки = кбп_КомпиляторСхем.НастройкиШага(Шаг);
	ИсполнителиШага.Очистить();
	Для Каждого Настройка Из Настройки.Исполнители Цикл
		ЗаполнитьЗначенияСвойств(ИсполнителиШага.Добавить(), Настройка);
	КонецЦикла;
	КнопкиШага.Очистить();
	СписокАвтовыполнения = Элементы.ЭлементШагаКнопкаАвтовыполнения.СписокВыбора;
	СписокАвтовыполнения.Очистить();
	СписокАвтовыполнения.Добавить("", НСтр("ru = '<по умолчанию>'"));
	Для Каждого Настройка Из Настройки.Кнопки Цикл
		СтрокаКнопки = КнопкиШага.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКнопки, Настройка);
		Условие = Настройка.УсловиеВидимости.Получить();
		Если кбп_Условия.УсловиеЗаполнено(Условие) Тогда
			СтрокаКнопки.ТекстВидимости = кбп_Условия.ПредставлениеУсловия(Условие);
		КонецЕсли;
		Условие = Настройка.УсловиеДоступности.Получить();
		Если кбп_Условия.УсловиеЗаполнено(Условие) Тогда
			СтрокаКнопки.ТекстДоступности = кбп_Условия.ПредставлениеУсловия(Условие);
		КонецЕсли;
		СписокАвтовыполнения.Добавить(Настройка.ИдКнопки, Настройка.Заголовок);
	КонецЦикла;

	СписокЛиний = Элементы.КнопкиШагаИдПерехода.СписокВыбора;
	СписокЛиний.Очистить();
	Для Каждого Выход Из кбп_КомпиляторСхем.ВыходыДляВыбора(Шаг) Цикл
		СписокЛиний.Добавить(Выход.Значение, Выход.Представление);
	КонецЦикла;
	ЗаголовокСвойств = СтрШаблон("%1: %2", Шаг.ТипШага, Шаг);

КонецПроцедуры

&НаСервере
Функция ЗагрузитьЛинию(ИдПерехода)

	Свойства = кбп_КомпиляторСхем.СвойстваПерехода(Версия, ИдПерехода);
	Если Свойства = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Лин_Наименование = СтрШаблон("%1 → %2", Свойства.Откуда, Свойства.Куда);
	Если ЗначениеЗаполнено(Свойства.Наименование) Тогда
		Лин_Наименование = Лин_Наименование + " (" + Свойства.Наименование + ")";
	КонецЕсли;
	Лин_Подпись = Свойства.Наименование;
	Лин_Порядок = Свойства.Порядок;
	Лин_ПоУмолчанию = Свойства.ПоУмолчанию;
	Лин_ЭтоВозврат = Свойства.ЭтоВозврат;
	Лин_ВидУсловия = Свойства.ВидУсловия;
	Лин_ОбработчикУсловия = Свойства.ОбработчикУсловия;
	Лин_ИдКнопки = Свойства.ИдКнопки;
	Лин_ТекстУсловия = ?(ЗначениеЗаполнено(Свойства.ТекстУсловия), Свойства.ТекстУсловия, НСтр("ru = 'не задано'"));
	Лин_ТипОткуда = Свойства.Откуда.ТипШага;

	// Результат задачи: кнопки шага, из которого выходит линия, и кнопки всех задач версии (для Условия).
	СписокКнопок = Элементы.Лин_ИдКнопки.СписокВыбора;
	СписокКнопок.Очистить();
	СписокКнопок.Добавить("", НСтр("ru = '<не задан>'"));
	Для Каждого Кнопка Из кбп_Действия.КнопкиВерсии(Версия) Цикл
		СписокКнопок.Добавить(Кнопка.Значение, Кнопка.Представление);
	КонецЦикла;
	ЗаголовокСвойств = СтрШаблон(НСтр("ru = 'Линия: %1'"), Лин_Наименование);
	Возврат Истина;

КонецФункции

// Видимость вкладок и полей панели по виду элемента; подсказка — что делает шаг или линия.
&НаСервере
Процедура НастроитьПанель()

	Типы = Перечисления.кбп_ТипыШагов;
	ЭтоШаг = (ТекущийВид = "Шаг");
	ЭтоЛиния = (ТекущийВид = "Линия");
	ТипШага = ?(ЭтоШаг, ЭлементШага.ТипШага, Неопределено);
	ЭтоЗадача = (ТипШага = Типы.Задача);

	Элементы.СтраницаШаг.Видимость = ЭтоШаг;
	Элементы.СтраницаИсполнители.Видимость = ЭтоЗадача;
	Элементы.СтраницаКнопки.Видимость = ЭтоЗадача;
	Элементы.СтраницаПоля.Видимость = ЭтоЗадача;
	Элементы.СтраницаЛиния.Видимость = ЭтоЛиния;
	Элементы.СтраницаПусто.Видимость = Не ЭтоШаг И Не ЭтоЛиния;
	ЭтоПроцесс = (ТекущийВид = "Процесс");
	ЭтоОповещение = (ТипШага = Типы.Оповещение);
	Элементы.СтраницаОповещения.Видимость = ЭтоЗадача Или ЭтоОповещение Или ЭтоПроцесс;
	Элементы.ОповещенияШагаСобытие.Видимость = Не ЭтоОповещение;
	Если ЭтоОповещение Тогда
		ПодсказкаОповещений = НСтр("ru = 'Кому отправить оповещение шага. Пусто — автору процесса.'");
	ИначеЕсли ЭтоПроцесс Тогда
		ПодсказкаОповещений = НСтр("ru = 'Для всех шагов процесса. Исполнитель задачи и автор (о завершении) получают оповещения и без настройки.'");
	Иначе
		ПодсказкаОповещений = НСтр("ru = 'Кого ещё оповестить о задаче этого шага. Исполнитель получает оповещение о назначении и просрочке и без настройки.'");
	КонецЕсли;
	Элементы.ФормаЗаписатьСвойства.Видимость = ЭтоШаг Или ЭтоЛиния Или ЭтоПроцесс;

	Если ЭтоШаг Тогда
		Для Каждого ИмяПоля Из СтрРазделить("ЭлементШагаИнструкция, ГруппаСрок, ЭлементШагаРежимНазначения,
			|ЭлементШагаВзятьВРаботу, ЭлементШагаРазрешенВозврат, ЭлементШагаРежимВозврата,
			|ЭлементШагаТотЖеИсполнительПриВозврате, ЭлементШагаВозвратВРодителя", ", " + Символы.ПС, Ложь) Цикл
			Элементы[ИмяПоля].Видимость = ЭтоЗадача;
		КонецЦикла;
		ЭтоАвтошаг = (ТипШага = Типы.Обработка Или ТипШага = Типы.Таймер Или ЭтоОповещение);
		Элементы.ЭлементШагаВидАвтошага.Видимость = ЭтоАвтошаг;
		Элементы.ЭлементШагаИнструкция.Видимость = ЭтоЗадача Или ЭтоОповещение;
		Элементы.ЭлементШагаИнструкция.Заголовок = ?(ЭтоОповещение,
			НСтр("ru = 'Текст оповещения (если шаблон не выбран)'"), НСтр("ru = 'Инструкция исполнителю'"));
		Элементы.ЭлементШагаШаблонОповещения.Видимость = ЭтоОповещение;
		Элементы.ЭлементШагаТипШага.Видимость = Не ЭтоАвтошаг;
		Элементы.ЭлементШагаОбработчик.Видимость = (ТипШага = Типы.Обработка);
		Элементы.ГруппаТаймер.Видимость = (ТипШага = Типы.Таймер);
		Элементы.ГруппаСлияние.Видимость = (ТипШага = Типы.Слияние);
		Элементы.ЭлементШагаКоличествоДляСлияния.Видимость =
			(ЭлементШага.РежимСлияния = Перечисления.кбп_РежимыСлияния.NизM);
		Элементы.ГруппаВложенный.Видимость = (ТипШага = Типы.ВложенныйПроцесс);
		Элементы.ГруппаМножественный.Видимость = ЭлементШага.МножественныйЗапуск;
		Элементы.ЭлементШагаКоличествоВложенных.Видимость =
			(ЭлементШага.РежимСлияния = Перечисления.кбп_РежимыСлияния.NизM);
		Элементы.ЭлементШагаРазрешенаПереадресация.Видимость = ЭтоЗадача;
		Элементы.ГруппаПросрочка.Видимость = ЭтоЗадача;
		ДействияПриПросрочке = Перечисления.кбп_ДействияПриПросрочке;
		Элементы.ЭлементШагаЭскалационнаяРоль.Видимость =
			(ЭлементШага.ДействиеПриПросрочке = ДействияПриПросрочке.Эскалация);
		Элементы.ГруппаАвтовыполнение.Видимость =
			(ЭлементШага.ДействиеПриПросрочке = ДействияПриПросрочке.Автовыполнение);
		ПодсказкаШага = ПодсказкаПоТипу(ТипШага);
		Элементы.ПодсказкаШага.Видимость = ЗначениеЗаполнено(ПодсказкаШага);
		ТекущаяСтраница = Элементы.СтраницыСвойств.ТекущаяСтраница;
		Если ТекущаяСтраница = Неопределено Или Не ТекущаяСтраница.Видимость Тогда
			Элементы.СтраницыСвойств.ТекущаяСтраница = Элементы.СтраницаШаг;
		КонецЕсли;
	ИначеЕсли ЭтоЛиния Тогда
		Элементы.СтраницыСвойств.ТекущаяСтраница = Элементы.СтраницаЛиния;
		ВидыУсловий = Перечисления.кбп_ВидыУсловий;
		Элементы.Лин_ОбработчикУсловия.Видимость = (Лин_ВидУсловия = ВидыУсловий.Обработчик);
		Элементы.ГруппаУсловиеОтбор.Видимость = (Лин_ВидУсловия <> ВидыУсловий.Обработчик);
		ПодсказкаЛинии = ПодсказкаЛинииПоТипу(Лин_ТипОткуда);
		Элементы.ПодсказкаЛинии.Видимость = ЗначениеЗаполнено(ПодсказкаЛинии);
	Иначе
		Элементы.СтраницыСвойств.ТекущаяСтраница = Элементы.СтраницаПусто;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодсказкаПоТипу(ТипШага)

	Типы = Перечисления.кбп_ТипыШагов;
	Если ТипШага = Типы.Старт Тогда
		Возврат НСтр("ru = 'Начало процесса. Из Старта выходит одна линия.'");
	ИначеЕсли ТипШага = Типы.Задача Тогда
		Возврат НСтр("ru = 'Задача исполнителю. Кому — вкладка «Исполнители», кнопки — «Кнопки», что заполнить — «Поля».'");
	ИначеЕсли ТипШага = Типы.Условие Тогда
		Возврат НСтр("ru = 'Две линии: у одной задайте условие (результат задачи, условие-отбор или обработчик), другую отметьте «По умолчанию».'");
	ИначеЕсли ТипШага = Типы.ВыборВарианта Тогда
		Возврат НСтр("ru = 'Ветка выбирается по кнопке предыдущей задачи (название варианта = заголовок кнопки), по условию на линии или «По умолчанию».'");
	ИначеЕсли ТипШага = Типы.Вариант Тогда
		Возврат НСтр("ru = 'Вариант «Выбора варианта». Настройте линию, которая из него выходит.'");
	ИначеЕсли ТипШага = Типы.Разделение Тогда
		Возврат НСтр("ru = 'Все исходящие ветки идут одновременно и должны сойтись в Слиянии. Ветка с условием-отбором запускается, только если условие выполнено.'");
	ИначеЕсли ТипШага = Типы.Слияние Тогда
		Возврат НСтр("ru = 'Ждёт ветки из Разделения. Когда пришло нужное число веток, остальные закрываются и процесс идёт дальше.'");
	ИначеЕсли ТипШага = Типы.Обработка Тогда
		Возврат НСтр("ru = 'Автоматический шаг: выполняет обработчик и идёт дальше. Вид шага «Таймер» — процесс ждёт.'");
	ИначеЕсли ТипШага = Типы.Таймер Тогда
		Возврат НСтр("ru = 'Процесс ждёт указанное время (или до даты из переменной), затем идёт дальше.'");
	ИначеЕсли ТипШага = Типы.Оповещение Тогда
		Возврат НСтр("ru = 'Отправляет оповещение и сразу идёт дальше. Кому — вкладка «Оповещения». В тексте можно использовать [Процесс], [Предмет], [Предмет.Номер], [Переменные.Имя].'");
	ИначеЕсли ТипШага = Типы.ВложенныйПроцесс Тогда
		Возврат НСтр("ru = 'Запускает процесс по другой схеме с тем же предметом и передаёт переменные.'");
	ИначеЕсли ТипШага = Типы.Завершение Тогда
		Возврат НСтр("ru = 'Процесс завершается, когда доходит сюда.'");
	КонецЕсли;
	Возврат "";

КонецФункции

&НаСервереБезКонтекста
Функция ПодсказкаЛинииПоТипу(ТипОткуда)

	Типы = Перечисления.кбп_ТипыШагов;
	Если ТипОткуда = Типы.Условие Или ТипОткуда = Типы.ВыборВарианта Тогда
		Возврат НСтр("ru = 'Задайте, когда выбирается эта ветка: результат задачи, условие-отбор или обработчик. Одну ветку отметьте «По умолчанию».'");
	ИначеЕсли ТипОткуда = Типы.Разделение Тогда
		Возврат НСтр("ru = 'Ветка разделения. Без условия идёт всегда, с условием-отбором — только если оно выполнено.'");
	ИначеЕсли ТипОткуда = Типы.Задача Тогда
		Возврат НСтр("ru = 'Если кнопки задачи не настроены, линия становится кнопкой с её подписью.'");
	КонецЕсли;
	Возврат "";

КонецФункции

// Название шага или подпись линии с панели — в элемент графической схемы (иначе при сохранении схемы
// название вернётся с картинки). Схема помечается изменённой.
&НаСервере
Процедура ПереименоватьНаСхеме(ИмяЭлемента, Наименование)

	Для Каждого ЭлементСхемы Из ГрафСхема.ЭлементыГрафическойСхемы Цикл
		Если ЭлементСхемы.Имя <> ИмяЭлемента Тогда
			Продолжить;
		КонецЕсли;
		Если Строка(ЭлементСхемы.Наименование) = Наименование Тогда
			Возврат;
		КонецЕсли;
		Попытка
			ЭлементСхемы.Наименование = Наименование;
		Исключение
			ЭлементСхемы.Наименование = Новый ФорматированнаяСтрока(Наименование);
		КонецПопытки;
		Модифицированность = Истина;
		Возврат;
	КонецЦикла;

КонецПроцедуры

// Записывает свойства элемента, открытого на панели.
&НаСервере
Процедура ЗаписатьСвойстваНаСервере(ОбновитьПанель = Истина)

	Если Не ЭтоЧерновик Или Не ЗначениеЗаполнено(ТекущийВид) Тогда
		Возврат;
	КонецЕсли;
	Если ТекущийВид = "Шаг" Тогда
		ШагОбъект = РеквизитФормыВЗначение("ЭлементШага");
		ПереименоватьНаСхеме(ШагОбъект.ИдЭлемента, ШагОбъект.Наименование);
		кбп_КомпиляторСхем.ЗаписатьНастройкиШага(ШагОбъект,
			РеквизитФормыВЗначение("ИсполнителиШага"), РеквизитФормыВЗначение("КнопкиШага"));
		Типы = Перечисления.кбп_ТипыШагов;
		Если ШагОбъект.ТипШага = Типы.Задача Или ШагОбъект.ТипШага = Типы.Оповещение Тогда
			кбп_КомпиляторСхем.ЗаписатьОповещенияШага(Версия, ШагОбъект.Ссылка, РеквизитФормыВЗначение("ОповещенияШага"),
				?(ШагОбъект.ТипШага = Типы.Оповещение, Перечисления.кбп_СобытияПроцессов.СобытиеШага, Неопределено));
		КонецЕсли;
	ИначеЕсли ТекущийВид = "Процесс" Тогда
		кбп_КомпиляторСхем.ЗаписатьОповещенияШага(Версия, Неопределено, РеквизитФормыВЗначение("ОповещенияШага"));
	Иначе
		ПереименоватьНаСхеме(ТекущийИд, Лин_Подпись);
		Свойства = Новый Структура(кбп_КомпиляторСхем.ПоляПерехода());
		Свойства.Порядок = Лин_Порядок;
		Свойства.ПоУмолчанию = Лин_ПоУмолчанию;
		Свойства.ЭтоВозврат = Лин_ЭтоВозврат;
		Свойства.ВидУсловия = Лин_ВидУсловия;
		Свойства.ОбработчикУсловия = Лин_ОбработчикУсловия;
		Свойства.ИдКнопки = Лин_ИдКнопки;
		Свойства.Наименование = Лин_Подпись;
		кбп_КомпиляторСхем.ЗаписатьСвойстваПерехода(Версия, ТекущийИд, Свойства);
	КонецЕсли;
	СвойстваИзменены = Ложь;

	Если ОбновитьПанель Тогда
		Ид = ТекущийИд;
		ТекущийИд = "";
		ЗагрузитьСвойстваНаСервере(Ид);
		ЗаполнитьШаги();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
